Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འདི་ནི་བསམ་གཏན་རྣམས་སོ།
en: These are the meditative concentrations.

source: །འདི་ནི་ཚད་མེད་པ་རྣམས་སོ།
en: These are the immeasurable attitudes.

source: །འདི་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སོ།
en: These are the formless absorptions.

source: །འདི་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་དོ།
en: These are the eight aspects of liberation.

source: །འདི་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའོ།
en: These are the nine serial steps of meditative absorption.

source: །འདི་ནི་རྣམས་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའོ།
en: These are the gateways to liberation—emptiness, signlessness, and wishlessness.

source: འདི་ནི་མངོན་པར་ཤེས་པ་རྣམས་སོ།
en: These are the extrasensory powers.

source: །འདི་ནི་ཏིང་ངེ་འཛིན་རྣམས་སོ།
en: These are the meditative stabilities.

source: །འདི་ནི་གཟུངས་ཀྱི་སྒོ་རྣམས་སོ།
en: These are the dhāraṇī gateways.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའོ།
en: These are the ten powers of the tathāgatas.

source: །འདི་ནི་མི་འཇིགས་པ་བཞིའོ།
en: These are the four fearlessnesses.

source: །འདི་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིའོ།
en: These are the four kinds of exact knowledge.

source: །འདི་ནི་བྱམས་པ་ཆེན་པོའོ།
en: This is great loving kindness.

source: །འདི་ནི་སྙིང་རྗེ་ཆེན་པོའོ།
en: This is great compassion.

source: །འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དོ།
en: These are the eighteen distinct qualities of the buddhas.

source: །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རོ་ཞེས་བགྱི་བའི་རྣམ་པར་རྟོག་པ་གང་ཡང་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: These are [the goals], up to and including all-aspect omniscience.’ ” “

source: གཟུགས་ཀྱི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དོ།
en: In the transcendence of physical forms there is no conceptual notion at all.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དོ།
en: In the transcendence of feelings, the transcendence of perceptions, the transcendence of formative predispositions, and the transcendence of consciousness there is no conceptual notion at all.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དོ། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་
en: In the transcendence of the sense fields, sensory elements, and links of dependent origination there is no conceptual notion at all.

source: མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དོ།
en: In the transcendence of all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, there is no conceptual notion at all.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དེ།
en: In the transcendence of [the goals], up to and including all-aspect omniscience, there is no conceptual notion at all.

source: །འདི་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའོ།
en: These are feelings, perceptions, formative predispositions, and consciousness.

source: །འདི་ནི་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ།
en: These are the sense fields, the sensory elements, and the links of dependent origination.

source: །འདི་ནི་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའོ།
en: These are the gateways to liberation—emptiness, signlessness, and wishlessness.

source: །འདི་ནི་མངོན་པར་ཤེས་པ་རྣམས་སོ།
en: These are the extrasensory powers.

source: །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དེ།
en: These are [the goals], up to and including all-aspect omniscience.’ “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་དེ་ལྟར་ཞི་བདག་ལ་རྟོག་ཀྱང་ཞུམ་པར་མི་འགྱུར་ཞིང་བདག་གིས་ཆོས་དེ་དག་ནི་འདི་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱའོ།
en: Subhūti, although they observe that those phenomena are at peace in that way, bodhisattva great beings take on the difficult thought, without being discouraged, ‘I will attain consummate buddhahood in accord with these phenomena!

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ནི་འདི་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་དེ་ལྟར་ཞི་བ་དང་། དེ་ལྟར་བཟང་བ་དེ་དག་བཤད་པར་བྱའོ་སྙམ་དུ་སེམས་པ་ནི་དཀའ་བ་བྱེད་པ་སྟེ།
en: Then, having attained consummate buddhahood in unsurpassed, complete enlightenment in that manner, I will explain how these phenomena are peaceful and excellent!’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འཇིག་རྟེན་གྱི་དཔུང་གཉེན་དུ་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འཇིག་རྟེན་གྱི་གླིང་དུ་གྱུར་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: It is in this way, Subhūti, that bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, act as an ally of the world. {

source: ཆུ་ཀླུང་ངམ།
en: Ki.

source: ཆུ་བྲན་ནམ། རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཆུས་ཡོངས་སུ་བཅད་པའི་གནས་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ནི་གླིང་ཞེས་བྱ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་གཟུགས་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: IV: 99} “If you ask, Subhūti, how bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, become an island for the world, just as, Subhūti, islands consist of land that is totally confined by water, whether by rivers, streams, or oceans, in the same way, Subhūti, physical forms are confined by the limit of past time and the limit of future time.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are confined by the limit of past time and the limit of future time.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: The sense fields, the sensory elements, and the links of dependent origination are confined by the limit of past time and the limit of future time.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: The perfection of generosity is confined by the limit of past time and the limit of future time.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྔོན་གྱི་མཐའ་དང་།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are confined by the limit of past time and the limit of future time.

source: ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ། །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: The emptiness of internal phenomena, the emptiness of external phenomena, and the emptiness of external and internal phenomena are confined by the limit of past time and the limit of future time.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ།
en: The [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are confined by the limit of past time and the limit of future time.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་།
en: The thirty-seven factors conducive to enlightenment are confined by the limit of past time and the limit of future time.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are confined by the limit of past time and the limit of future time. [

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་སྔོན་གྱི་མཐའ་དང་།
en: The goals], up to and including all-aspect omniscience, are confined by the limit of past time and the limit of future time. “

source: ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ། །རབ་འབྱོར་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པ་འདིས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཆད་པ་སྟེ།
en: Subhūti, all phenomena are confined by these delimiting phenomena, comprising the limit of past time and the limit of future time.

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པ་གང་ཡིན་པ་དེ་ནི་ཞི་བའོ། །དེ་ནི་བཟང་པོའོ། །དེ་ནི་ཡང་དག་པ་སྟེ།
en: Subhūti, that which confines all phenomena by the limit of past time and the limit of future time is peaceful; it is excellent and it is authentic.

source: འདི་ལྟར་སྟོང་པ་ཉིད་དང་། དམིགས་སུ་མེད་པ་དང་། ལམ་གྱི་རྒྱུན་ཆད་པ་དང་། སྲེད་པ་ཟད་པ་དང་། འདྲེ་བ་མེད་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་།
en: That is to say, it is [also known as] emptiness, nonapprehension, the termination of the path, the exhaustion of craving, the nonembracing [of phenomena], freedom from desire, cessation, and nirvāṇa.

source: འགོག་པ་དང་། མྱ་ངན་ལས་འདས་པ་སྟེ། རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། དེ་ལྟར་ཞི་བ་དང་། དེ་ལྟར་བཟང་པོའི་ཆོས་དེ་དག་སྟོན་ཏེ།
en: It is in this way, Subhūti, that bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, reveal these phenomena that are peaceful and excellent.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ཀྱི་གླིང་དུ་གྱུར་པ་ཡིན་ནོ།
en: It is in this way, Subhūti, that bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, become an island for beings. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འཇིག་རྟེན་གྱི་སྣང་བར་གྱུར་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡུན་རིང་དུ་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་ཀྱི་རབ་རིབ་ཀྱིས་ཀུན་ནས་འཁྲིས་ཤིང་མུན་པས་ཟིལ་གྱིས་ནོན་པའི་སེམས་ཅན་རྣམས་ལ་ཤེས་རབ་ཀྱིས་སྣང་བར་བྱེད་ཅིང་།
en: If you ask, Subhūti, how bodhisattva great beings become a lamp for the world after having attained consummate buddhahood in unsurpassed, complete enlightenment, in this regard, Subhūti, for a long time they act as a lamp through their wisdom for the sake of beings who are trapped in the obscurity of the eggshell of ignorance and overwhelmed by darkness.

source: གཏི་མུག་གི་མུན་པ་དང་། མ་རིག་པའི་མུན་གནག་དང་། མི་ཤེས་པའི་རབ་རིབ་སེལ་ཏེ།
en: They dispel the darkness of delusion, the gloom of ignorance, and the obscurity of unknowing.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འཇིག་རྟེན་གྱི་སྣང་བར་གྱུར་པ་ཡིན་ནོ།
en: It is in this way, Subhūti, that bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, become a lamp for the world. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་སྒྲོན་མ་འཛིན་ཅིང་འོད་འབྱིན་པ་ཡིན་ཞེ་ན།
en: If you ask, Subhūti, how bodhisattva great beings become a torchbearer and a beacon of light for beings after attaining consummate buddhahood in unsurpassed, complete enlightenment, in this regard, Subhūti, {Ki.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། མདོ་སྡེ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པ། བྱིན་གྱི་རླབས་བཞི་དང་ལྡན་པ། བསྡུ་བའི་དངོས་པོ་བཞི་དང་ལྡན་པ་དེ་དག་གི་དོན་མ་ནོར་བར། སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་སྟོན་སྟེ།
en: IV: 100} bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, reveal to beings without error the meaning of the sūtras endowed with the six perfections, endowed with the four modes of blessing, and endowed with the four attractive qualities.

source: སེམས་ཅན་རྣམས་ཀྱང་དེ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་སྦྱོར་ལ། གཞོག་ཅིང་རབ་ཏུ་འགོད་དེ།
en: They also encourage beings toward them, and they secure and establish them there.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་སྒྲོན་མ་འཛིན་ཅིང་འོད་འབྱིན་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་དེད་དཔོན་དུ་གྱུར་པ་ཡིན་ཞེ་ན།
en: It is in this way, Subhūti, that bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, act as a torchbearer and beacon of light for beings. “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ལམ་ངན་པར་ཞུགས་ཤིང་ཚུལ་མ་ཡིན་པ་བཞི་ལ་ཞེན་པ་རྣམས་ལ། སེམས་ཅན་རྣམ་པར་དག་པར་བྱ་བའི་དོན་དུ་མྱ་ངན་དང་གནོད་པ་ལས་ཡང་དག་པར་བཟླ་བ་དང་། སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་ནུབ་པར་བྱ་བ་དང་། རིག་པ་དང་ལྡན་པའི་ཆོས་གོ་བར་བྱ་བ་དང་། མྱ་ངན་ལས་འདས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་གཅིག་ལ་རྟེན་པའི་ལམ་སྟོན་ཏོ།
en: If you ask, Subhūti, how bodhisattva great beings become a helmsman for beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, in this regard, Subhūti, bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, reveal the sole reliable path to beings who have gone astray on mistaken paths and are attached to the four modes of improper perspective, in order that beings might achieve purification, because it genuinely transcends sorrow and affliction, causes suffering and discomfort to subside, induces understanding of the Dharma that is endowed with awareness, and causes nirvāṇa to be actualized.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་དེད་དཔོན་དུ་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་འདྲེན་པར་གྱུར་པ་ཡིན་ཞེ་ན།
en: It is in this way, Subhūti, that bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, become a helmsman for beings. “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། གཟུགས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: If you ask, Subhūti, how bodhisattva great beings become a guide for beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, in this regard, Subhūti, bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, reveal the Dharma to the effect that physical forms neither arise nor cease, and are neither afflicted nor purified.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: They reveal the Dharma to the effect that feelings, perceptions, formative predispositions, and consciousness neither arise nor cease, and are neither afflicted nor purified.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: They reveal the Dharma to the effect that the sense fields, the sensory elements, and the links of dependent origination neither arise nor cease, and are neither afflicted nor purified.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: They reveal the Dharma to the effect that the perfection of generosity neither arises nor ceases, and is neither afflicted nor purified.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མེད་པ་དང་།
en: They reveal the Dharma to the effect that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom neither arise nor cease, and are neither afflicted nor purified.

source: འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །ནང་སྟོང་པ་ཉིད་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་།
en: They reveal the Dharma to the effect that the emptiness of internal phenomena neither arises nor ceases, and is neither afflicted nor purified.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: They reveal the Dharma to the effect that [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, neither arise nor cease, and are neither afflicted nor purified.

source: རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: They reveal the Dharma to the effect that the applications of mindfulness neither arise nor cease, and are neither afflicted nor purified.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They reveal the Dharma to the effect that [the other causal attributes], up to and including the noble eightfold path, neither arise nor cease, and are neither afflicted nor purified.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྐྱེད་བ་མེད་པ་དང་།
en: IV: 101} the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas neither arise nor cease, and are neither afflicted nor purified.

source: འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: They reveal the Dharma to the effect that the fruit of entering the stream to nirvāṇa neither arises nor ceases, and is neither afflicted nor purified.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་སྐྱེ་བ་མེད་པ་དང་།
en: They reveal the Dharma to the effect that the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and [the other goals], up to and including unsurpassed, complete enlightenment, neither arise nor cease, and are neither afflicted nor purified.

source: འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་འདྲེན་པར་གྱུར་པ་ཡིན་ནོ།
en: It is in this way, Subhūti, that bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, become a guide for beings. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ལམ་དུ་གྱུར་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། གཟུགས་ནི་ནམ་མཁའི་ངང་ཚུལ་ཅན་ཞེས་བྱ་བར་སེམས་རྣམས་ལས་ཆོས་སྟོན་ཏོ།
en: If you ask, Subhūti, how bodhisattva great beings become a pathway for beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, in this regard, Subhūti, bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, reveal to beings the Dharma that physical forms are of the nature of space.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་ནམ་མཁའི་ངང་ཚུལ་ཅན་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །སྐྱེ་མཆེད་དང་།
en: They reveal to beings the Dharma that feelings, perceptions, formative predispositions, and consciousness are of the nature of space.

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་ནམ་མཁའི་ངང་ཚུལ་ཅན་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་
en: They reveal to beings the Dharma that the sense fields, the sensory elements, and the links of dependent origination are of the nature of space.

source: མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་ནམ་མཁའི་ངང་ཚུལ་ཅན་ཞེས་བྱ་བར་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: They reveal to beings the Dharma that all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are of the nature of space.
